app/views/comments/_form.html.erb

        <%= f.label :user %>
        <%= f.collection_select :user_id, User.all, :id, :name, include_blank: false %>
---
SELECT "users".* FROM "users"