app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    #@post =Post.find(params[:id])
    Post.destroy(params[:id])