app/controllers/replies_controller.rb

  def create #reply
    @reply=Reply.new(reply_params)
    if @reply.save #if this returns not nill values, then it is success
      flash.notice = "The reply was created successfully."
    else
      flash.now.alert = @reply.errors.full_messages.to_sentence
    end

    c=Comment.find(params[:reply][:comment_id])
---
INSERT INTO "replies" ("comment_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1623929070], ["LIMIT", 1]]