app/controllers/users_controller.rb

  def create
    #@user= User.new(params[:user])
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "salt") VALUES (?, ?, ?, ?, ?)